# Anatomy of a Virtual Dispatch

## Basic Virtual Dispatch in CPP (gcc)

Minimal example of a virtual call. `bba->a_func()` will call `B::a_func()`.

```cpp
class A {
public:
    virtual int a_func() {return 1;}

    // To illustrate what happens when a function is not overriden.
    virtual int a_foo() {return 2;}
};

class B : public A {
public:
    virtual int a_func() {return 3;}
};


// These are declared globally so we can easily see
// where they are stored (otherwise they'd be on the stack)
A aa; // Intantiate this otherwise the compiler wont generate a vtable for A; even without compilation.
B bb;

int main() {
    A* bba = &bb;

    return bba->a_func();
}
```

This is the assembly produced by gcc with `-fno-rtti` targeting x86_64. Run-time information is removed because it distracts from the gist. I've annotated the assembly to show what is happening.

```assembly
B::a_func():
        push    rbp
        mov     rbp, rsp
        mov     QWORD PTR [rbp-8], rdi
        mov     eax, 3
        pop     rbp
        ret
bb:
        .quad   vtable for B+16
main:
        push    rbp
        mov     rbp, rsp
        sub     rsp, 16
        
        # Load &bb into [rbp-8]. In Intel asm, this means *addr(rbp-8) = &bb
        mov     QWORD PTR [rbp-8], OFFSET FLAT:bb

        # This is the start of the virtual dispatch.
        # Load &bb into rax
        mov     rax, QWORD PTR [rbp-8]

        # Load *(&bb) into rax (the hidden first member of class B)

        lea     rax, [rbp-32]
        mov     rdi, rax
        call    B::B() [complete object constructor]
        lea     rax, [rbp-32]
        mov     QWORD PTR [rbp-8], rax
        mov     rax, QWORD PTR [rbp-8]
        mov     rdi, rax
        call    AFunc::non_virtual_a_func()
        nop
        leave
        ret
vtable for B:
        .quad   0
        .quad   0
        .quad   B::a_func()
vtable for AFunc:
        .quad   0
        .quad   0
        .quad   __cxa_pure_virtual
```

```c
struct AFunc {
       struct AVTable* vtable_ptr; 
       int my_i;
};

struct AFuncVTable {
        int (*a_func)(struct AFunc*);
};
struct AFuncVTable vtable_for_afunc;


void AFunc_constructor(struct AFunc* self) {
        self->vtable_ptr = &vtable_for_afunc;
}

int AFunc_non_virtual_a_func(struct AFunc* self) {
        // Regardless of what is passed in here
        // struct AFunc {
        //      struct AFuncVTable* vtable_ptr; 
        //      int my_i;                                  <--- self->afunc_data will always look here!
        // }
        // 
        // suppose we pass in the following struct as AFunc
        // struct DerivedFromAFunc 
        //      struct DerivedFromAFuncVTable* vtable_ptr; 
        //                                                 <--- Uhh oh! Nothing here, will return garbage.
        // }
        return self->my_i;
}

struct B {
        struct BVTable* vtable_ptr;
        int my_i; // Necessary for structural compatibility.
};

struct BVTable {
        int (*a_func)(struct B*);
};
struct BVTable vtable_for_b;

void B_constructor(struct B* self) {
        AFunc_constructor(self);
        self->vtable_ptr = &vtable_for_b;
}

int impl_a_func_for_b(struct B* self) {
        return 3;
}

int my_virtual_dispatch(struct AFunc* obj) {
        AFunc_non_virtual_a_func(obj);

        return obj->vtable_ptr->a_func(obj);
}

int main() 
{       
        // Normally done at compile time.
        vtable_for_a.a_func = (void*)0; // Pure virtual, normally compiler error, but will crash in C.
        vtable_for_b.a_func = &impl_a_func_for_b;

        struct B bb;
        B_constructor(&bb);

        return my_virtual_dispatch((struct AFunc*)&bb);
}
```

Here's where this gets hairy. What if we inherit from multiple class that aren't strictly pure virtual? Perhaps we start with inheriting from two classes with only virtual functions.


## Notes

### Compiler Layout Dumps

You can tell clang to dump the virtual table layout via `-Xclang -fdump-vtable-layouts`, which produces something like

For this input:

```
class AFunc {
    int my_a = 2;
public:
    virtual int a_func() {return 0;};
};

class XFunc {
    int my_x = 0;
public:
    virtual int x_func() {return 3;}
};


class B : public XFunc, public AFunc {
        int my_b = 3;
public:
    virtual int a_func() {return 5;}
    virtual int b_func() {return 5;}
};

B bb;

int main() {
    AFunc* bba = &bb;

    return bba->a_func();
}
```

Gives

```
Vtable for 'B' (8 entries).
   0 | offset_to_top (0)
   1 | B RTTI
       -- (B, 0) vtable address --
       -- (XFunc, 0) vtable address --
   2 | int XFunc::x_func()
   3 | int B::a_func()
   4 | int B::b_func()
   5 | offset_to_top (-16)
   6 | B RTTI
       -- (AFunc, 16) vtable address --
   7 | int B::a_func()
       [this adjustment: -16 non-virtual]

Thunks for 'int B::a_func()' (1 entry).
   0 | this adjustment: -16 non-virtual

VTable indices for 'B' (2 entries).
   1 | int B::a_func()
   2 | int B::b_func()

Vtable for 'AFunc' (3 entries).
   0 | offset_to_top (0)
   1 | AFunc RTTI
       -- (AFunc, 0) vtable address --
   2 | int AFunc::a_func()

VTable indices for 'AFunc' (1 entries).
   0 | int AFunc::a_func()

Vtable for 'XFunc' (3 entries).
   0 | offset_to_top (0)
   1 | XFunc RTTI
       -- (XFunc, 0) vtable address --
   2 | int XFunc::x_func()

VTable indices for 'XFunc' (1 entries).
   0 | int XFunc::x_func()

Compiler returned: 0

```

You can tell MSVC to do something similar. `/d1reportAllClassLayout`, however this produces a lot of output. Perhaps better to use the single class version. Note however that you can only specify one class. `/GR-` is MSVC for `-fno-rtti`.
```
/d1reportSingleClassLayoutXFunc
/d1reportSingleClassLayoutAFunc
/d1reportSingleClassLayoutXB
```

The nice thing about MSVC is that it even includes the class layout.

```
/GR- /d1reportSingleClassLayoutB

example.cpp

class _s__RTTIBaseClassDescriptor	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---

class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---

class B	size(20):
	+---
 0	| +--- (base class XFunc)
 0	| | {vfptr}
 4	| | my_x
	| +---
 8	| +--- (base class AFunc)
 8	| | {vfptr}
12	| | my_a
	| +---
16	| my_b
	+---

B::$vftable@XFunc@:
	| &B_meta
	|  0
 0	| &XFunc::x_func 
 1	| &B::b_func 

B::$vftable@AFunc@:
	| -8
 0	| &B::a_func 

B::a_func this adjustor: 8
B::b_func this adjustor: 0
Compiler returned: 0
```

## Misc

The `top_pointer` in the vtables produced by GCC seem to only be needed for dynamic_cast?? I can't think of a reason why that would be necessary otherwise. What's weird is that it's present even when `-fno-rtti` is specified, which means dynamic cast won't work anyway??

```
class A {
    int a_1 = 1;
public:
    virtual int a_func() {return a_1;}
};

class X {
public:
    virtual int x_func() {return 4;}
    virtual int x_foo() {return 3;}
};

class Y : public X {
public:
    virtual int x_foo() {return 9;} 
    virtual int y_func() {return 5;}
};

class B : public A, public Y {
    int b_2 = 2;
public:
